---
kind: method
id: M:Autodesk.Revit.DB.PaperSourceSet.ReverseIterator
source: html/a13727a0-ead9-079e-26ae-45cfaaad3a92.htm
---
# Autodesk.Revit.DB.PaperSourceSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual PaperSourceSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.